app/controllers/posts_controller.rb

	def index
		@post = Post.all.order("created_at DESC")
---
SELECT "posts".* FROM "posts"  ORDER BY created_at DESC

	def update
		if @post.update(post_params)
---
UPDATE "posts" SET "status" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["status", "Senior Surgon"], ["updated_at", "2016-07-07 18:15:50.364783"], ["id", 19]]